Enums/ЦветаОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ЦветаОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Красный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Синий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Желтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оранжевый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лиловый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ФлагиОбъектовПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Получает картинку флага.
//
// Параметры:
//  ФлагИлиИдентификатор - Перечисление.ЦветаОбъектов - Значение флага объекта.
// 
// Возвращаемое значение:
//  Картинка - Картинка соответствующая флагу.
//
Функция ПолучитьКартинкуПоФлагу(ФлагИлиИдентификатор) Экспорт

	Если ТипЗнч(ФлагИлиИдентификатор) = Тип("Строка") Тогда
		ИмяФлага = СтрШаблон(
			"Перечисление.ЦветаОбъектов.%1", ФлагИлиИдентификатор);
	
		Флаг = ПредопределенноеЗначение(ИмяФлага);

	Иначе
		Флаг = ФлагИлиИдентификатор;

	КонецЕсли;

	Если Флаг = ПредопределенноеЗначение("Перечисление.ЦветаОбъектов.ПустаяСсылка") 
		Или Флаг = ПредопределенноеЗначение("Перечисление.ЦветаОбъектов.Нет") Тогда
		КартинкаФлага = БиблиотекаКартинок.Заглушка;

	ИначеЕсли Флаг = ПредопределенноеЗначение("Перечисление.ЦветаОбъектов.Желтый") Тогда
		КартинкаФлага = БиблиотекаКартинок.КомандаЦветЖелтый;

	ИначеЕсли Флаг = ПредопределенноеЗначение("Перечисление.ЦветаОбъектов.Зеленый") Тогда
		КартинкаФлага = БиблиотекаКартинок.КомандаЦветЗеленый;

	ИначеЕсли Флаг = ПредопределенноеЗначение("Перечисление.ЦветаОбъектов.Красный") Тогда
		КартинкаФлага = БиблиотекаКартинок.КомандаЦветКрасный;

	ИначеЕсли Флаг = ПредопределенноеЗначение("Перечисление.ЦветаОбъектов.Лиловый") Тогда
		КартинкаФлага = БиблиотекаКартинок.КомандаЦветЛиловый;

	ИначеЕсли Флаг = ПредопределенноеЗначение("Перечисление.ЦветаОбъектов.Оранжевый") Тогда
		КартинкаФлага = БиблиотекаКартинок.КомандаЦветОранжевый;

	ИначеЕсли Флаг = ПредопределенноеЗначение("Перечисление.ЦветаОбъектов.Синий") Тогда
		КартинкаФлага = БиблиотекаКартинок.КомандаЦветСиний;

	КонецЕсли;

	Возврат КартинкаФлага;

КонецФункции

#КонецОбласти
